Revit 2027 API
CurveByPointsUtils.SetSketchOnSurface Method
 Sets the relationship between the CurveElement and face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetSketchOnSurface(
	CurveElement curveElem,
	bool sketchOnSurface
)
Public Shared Sub SetSketchOnSurface (
	curveElem As CurveElement,
	sketchOnSurface As Boolean
)
public:
static void SetSketchOnSurface(
	CurveElement^ curveElem,
	bool sketchOnSurface
)
static member SetSketchOnSurface :
        curveElem : CurveElement *
        sketchOnSurface : bool -> unit
Parameters
curveElem CurveElement
 The CurveElement.
sketchOnSurface Boolean
 Whether or not the CurveElement should lie on the face and be able to be added to the face.
Exceptions
Exception | Condition
ArgumentException |  The input CurveElement is not a CurveByPoints.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace